In [35]:
#7.1 Handling Missing Data

In [36]:
import pandas as pd
import numpy as np

In [37]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [38]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [39]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [40]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [41]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [42]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [43]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [44]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [45]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [46]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [47]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [48]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [49]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
   ....:                      [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [50]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [51]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [52]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [53]:
 data[4] = np.nan

In [54]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [55]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [56]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [57]:
df.iloc[:4, 1] = np.nan

In [58]:
df.iloc[:2, 2] = np.nan

In [59]:
df

          0         1         2
0 -1.509601       NaN       NaN
1  0.019478       NaN       NaN
2 -0.194344       NaN  0.453034
3  0.297116       NaN -0.064304
4  1.190372  1.787622  0.069885
5  0.012013  1.155560  0.836304
6 -1.805559 -1.122518  0.800350

In [60]:
df.dropna()

          0         1         2
4  1.190372  1.787622  0.069885
5  0.012013  1.155560  0.836304
6 -1.805559 -1.122518  0.800350

In [61]:
df.dropna(thresh=2)

          0         1         2
2 -0.194344       NaN  0.453034
3  0.297116       NaN -0.064304
4  1.190372  1.787622  0.069885
5  0.012013  1.155560  0.836304
6 -1.805559 -1.122518  0.800350

In [62]:
df.fillna(0)

          0         1         2
0 -1.509601  0.000000  0.000000
1  0.019478  0.000000  0.000000
2 -0.194344  0.000000  0.453034
3  0.297116  0.000000 -0.064304
4  1.190372  1.787622  0.069885
5  0.012013  1.155560  0.836304
6 -1.805559 -1.122518  0.800350

In [63]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.509601  0.500000  0.000000
1  0.019478  0.500000  0.000000
2 -0.194344  0.500000  0.453034
3  0.297116  0.500000 -0.064304
4  1.190372  1.787622  0.069885
5  0.012013  1.155560  0.836304
6 -1.805559 -1.122518  0.800350

In [64]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [65]:
df.iloc[2:, 1] = np.nan

In [66]:
df.iloc[4:, 2] = np.nan

In [67]:
df

          0         1         2
0  0.360212  0.486536 -0.439313
1 -0.804091  0.096839  1.569098
2  0.196944       NaN  0.592254
3 -1.602766       NaN  0.460377
4 -0.814995       NaN       NaN
5 -0.867788       NaN       NaN

In [68]:
df.fillna(method="ffill")

/var/folders/7p/qztwv_qj6yzd1hbc3bcpvt_c0000gp/T/ipykernel_54286/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.360212  0.486536 -0.439313
1 -0.804091  0.096839  1.569098
2  0.196944  0.096839  0.592254
3 -1.602766  0.096839  0.460377
4 -0.814995  0.096839  0.460377
5 -0.867788  0.096839  0.460377

In [70]:
#df.fillna(method="ffill", limit=2)
df.ffill(limit=2)

          0         1         2
0  0.360212  0.486536 -0.439313
1 -0.804091  0.096839  1.569098
2  0.196944  0.096839  0.592254
3 -1.602766  0.096839  0.460377
4 -0.814995       NaN  0.460377
5 -0.867788       NaN  0.460377

In [71]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [72]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [74]:
#7.2 Data Transformation

In [75]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
   ....:                      "k2": [1, 1, 2, 3, 3, 4, 4]})

In [76]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [77]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [78]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [79]:
data["v1"] = range(7)

In [80]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [81]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [82]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
   ....:                               "pastrami", "corned beef", "bacon",
   ....:                               "pastrami", "honey ham", "nova lox"],
   ....:                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [83]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [84]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [85]:
data["animal"] = data["food"].map(meat_to_animal)

In [86]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [87]:
def get_animal(x):
   ....:     return meat_to_animal[x]

In [88]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [89]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [90]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [91]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [92]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [93]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [94]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [95]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=["Ohio", "Colorado", "New York"],
   ....:                     columns=["one", "two", "three", "four"])

In [96]:
def transform(x):
   ....:     return x[:4].upper()

In [97]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [98]:
data.index = data.index.map(transform)

In [99]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [100]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [101]:
data.rename(index={"OHIO": "INDIANA"},
   ....:             columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [102]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [103]:
bins = [18, 25, 35, 60, 100]

In [104]:
age_categories = pd.cut(ages, bins)

In [105]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [106]:
age_categories.codes
age_categories.categories
age_categories.categories[0]
pd.value_counts(age_categories)

/var/folders/7p/qztwv_qj6yzd1hbc3bcpvt_c0000gp/T/ipykernel_54286/4232757300.py:4: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [107]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [108]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [109]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)

[(0.05, 0.27], (0.05, 0.27], (0.05, 0.27], (0.7, 0.92], (0.7, 0.92], ..., (0.48, 0.7], (0.48, 0.7], (0.27, 0.48], (0.48, 0.7], (0.27, 0.48]]
Length: 20
Categories (4, interval[float64, right]): [(0.05, 0.27] < (0.27, 0.48] < (0.48, 0.7] < (0.7, 0.92]]

In [112]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)
quartiles
pd.value_counts(quartiles)

/var/folders/7p/qztwv_qj6yzd1hbc3bcpvt_c0000gp/T/ipykernel_54286/3037377620.py:4: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.88, -0.66]    250
(-0.66, 0.012]    250
(0.012, 0.75]     250
(0.75, 3.06]      250
Name: count, dtype: int64

In [113]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.868, -1.29]    100
(-1.29, 0.0122]    400
(0.0122, 1.376]    400
(1.376, 3.057]     100
Name: count, dtype: int64

In [114]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000538    -0.005780     0.010461     0.006988
std       1.024925     0.962040     0.990055     0.985149
min      -3.323388    -3.068372    -3.505638    -3.388666
25%      -0.689149    -0.650830    -0.667330    -0.613743
50%       0.003027     0.019840     0.045813     0.012572
75%       0.664818     0.690667     0.689353     0.652648
max       3.703916     2.786960     3.034072     3.248919

In [115]:
col = data[2]
col[col.abs() > 3]

784   -3.505638
936    3.034072
Name: 2, dtype: float64

In [116]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
481 -3.277175  1.554875 -0.666046 -0.372969
655  3.036091  1.202873 -1.301258 -0.141326
665  0.297247 -0.195454 -0.563566 -3.003998
767  0.325725 -1.474472  0.707890 -3.388666
784 -0.815355  1.358335 -3.505638  0.402121
838 -0.611242 -0.411490 -0.169875  3.248919
851 -0.579909 -3.068372 -0.737170  0.355231
870  3.703916 -1.612060  0.046352  0.417959
936  1.925022  0.682517  3.034072  0.090594
947 -3.323388 -1.042949  0.124859  0.514254
958 -1.161017  0.837989  0.487656 -3.060530
981  3.638631  0.834716 -0.999964 -0.734084

In [117]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000240    -0.005711     0.010933     0.007192
std       1.018576     0.961825     0.988281     0.982895
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.689149    -0.650830    -0.667330    -0.613743
50%       0.003027     0.019840     0.045813     0.012572
75%       0.664818     0.690667     0.689353     0.652648
max       3.000000     2.786960     3.000000     3.000000

In [118]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0 -1.0 -1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [119]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df
sampler = np.random.permutation(5)
sampler

array([3, 1, 2, 0, 4])

In [120]:
df.take(sampler)
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34

In [121]:
column_sampler = np.random.permutation(7)
column_sampler
df.take(column_sampler, axis="columns")

    5   2   0   3   4   1   6
0   5   2   0   3   4   1   6
1  12   9   7  10  11   8  13
2  19  16  14  17  18  15  20
3  26  23  21  24  25  22  27
4  33  30  28  31  32  29  34

In [122]:
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34

In [123]:
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

0    5
3    6
1    7
1    7
4    4
4    4
3    6
1    7
2   -1
0    5
dtype: int64

In [124]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [125]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [128]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("examples/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [129]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [130]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [131]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [132]:
#7.3 Extension Data Types

In [133]:

s = pd.Series([1, 2, 3, None])
s
s.dtype

dtype('float64')

In [134]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s
s.isna()
s.dtype

Int64Dtype()

In [135]:
s[3]
s[3] is pd.NA

True

In [136]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [137]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [138]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [139]:
#7.4 String Manipulation

In [140]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [141]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [142]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [143]:
"::".join(pieces)

'a::b::guido'

In [144]:
"guido" in val
val.index(",")
val.find(":")

-1

In [145]:
val.index(":")

ValueError: substring not found

In [146]:
val.count(",")

2

In [147]:
val.replace(",", "::")
val.replace(",", "")

'ab  guido'

In [148]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [149]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [150]:
regex.findall(text)

['    ', '\t ', '  \t']

In [151]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [152]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [153]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [154]:
print(regex.match(text))

None

In [155]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [156]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [157]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [158]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [159]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [160]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [161]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [162]:
data_as_string_ext = data.astype('string')
data_as_string_ext
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [163]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [164]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [165]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [166]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [167]:
#7.5 Categorical Data

In [168]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values
pd.unique(values)
pd.value_counts(values)

/var/folders/7p/qztwv_qj6yzd1hbc3bcpvt_c0000gp/T/ipykernel_54286/3503291848.py:5: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [169]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values
dim

0     apple
1    orange
dtype: object

In [170]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [171]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [172]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [173]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [174]:
c.categories
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [175]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [176]:
df['fruit'] = df['fruit'].astype('category')
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [177]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [178]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [179]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [180]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [181]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [182]:
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [183]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [184]:
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count', 'min', 'max'])
           .reset_index())
results

/var/folders/7p/qztwv_qj6yzd1hbc3bcpvt_c0000gp/T/ipykernel_54286/2483392743.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [185]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [186]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [187]:
categories = labels.astype('category')

In [188]:
labels.memory_usage(deep=True)
categories.memory_usage(deep=True)

10000512

In [189]:
%time _ = labels.astype('category')

CPU times: user 220 ms, sys: 23 ms, total: 244 ms
Wall time: 244 ms

In [190]:
%timeit labels.value_counts()
%timeit categories.value_counts()

218 ms  1.09 ms per loop (mean  std. dev. of 7 runs, 1 loop each)
31.4 ms  380 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [191]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [192]:
cat_s.cat.codes
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [193]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [194]:
cat_s.value_counts()
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [195]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [196]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [197]:
pd.get_dummies(cat_s, dtype=float)

     a    b    c    d
0  1.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0